# Reshaping and Pivot Tables

## 1 Main data maniputlations

We will cover in this notebook how to reshape data from LONG to WIDE and alo from WIDE to LONG format.

## 2 Two main data layouts

**Two main data layouts**

- When working with data, we might have our DataFrame structured in two main ways: 

- a) **staked** or **LONG** format: There are **Multiple** rows for each subject where applicable.

- b) In a **record** or **WIDE** format: Typically there is **one row** for each subject.

### 1.1 Long format

In the **stacked** or **long** format, there are multiple rows for each subject where applicable.

In [4]:
import pandas as pd

In [7]:
data = { "value": range(12),
        "variable":["A"]*3 + ["B"]*3 + ["C"]*3 + ["D"]* 3,
        "date": pd.to_datetime(["2020-01-03","2020-01-04","2020-01-05"]*4)}

We have made a dictionary that then we turn into a DataFrame

In [10]:
type(data)

dict

In [8]:
df = pd.DataFrame(data)

In [9]:
df.head()

   value variable       date
0      0        A 2020-01-03
1      1        A 2020-01-04
2      2        A 2020-01-05
3      3        B 2020-01-03
4      4        B 2020-01-04

### 1.1 Wide format

In the **record** or **wide** format, there is one row for each subject.

## 3. Data reshape

To be specific about what these two data reshape operations mean: 

- LONG to WIDE: We transform initial **dataframe** from **LONG** to **WIDE** format, we increase the number of **COLUMNS**, reducing the number of **rows**.

- WIDE to LONG: We transform initial **dataframe** from **WIDE** to **LONG** format, we increase the number of **ROWS**, reducing the number of **columns**.

### 3.1 LONG to WIDE

We use **pivot()** method to reshape data from LONG into WIDE

In [11]:
df.head()

   value variable       date
0      0        A 2020-01-03
1      1        A 2020-01-04
2      2        A 2020-01-05
3      3        B 2020-01-03
4      4        B 2020-01-04

We use **pivot()** method  to turn **value** and **variable** columns fropm **LONG** to **WIDE** format:

In [13]:
pivoted = df.pivot(index = "date", columns = "variable", values = "value")
pivoted.head()

variable    A  B  C   D
date
2020-01-03  0  3  6   9
2020-01-04  1  4  7  10
2020-01-05  2  5  8  11

In [15]:
pivoted.columns

Index(['A', 'B', 'C', 'D'], dtype='object', name='variable')

- Another example of pivoting data from LONG to WIDE

In [16]:
df2 = pd.DataFrame({
    'year': [2010, 2010, 2011, 2011],
    'city': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'population': [8175133, 3792621, 8491079, 3971883]
})

In [17]:
df2.head()

   year         city  population
0  2010     New York     8175133
1  2010  Los Angeles     3792621
2  2011     New York     8491079
3  2011  Los Angeles     3971883

Again we pivot previous data frame from Long to Wide using **pivot()** method  to turn **value** and **variable** columns fropm **LONG** to **WIDE** format:

In [56]:
df2_wide = df2.pivot(index = 'year', columns = 'city', values = 'population')

In [57]:
print(df2_wide)

city  Los Angeles  New York
year
2010      3792621   8175133
2011      3971883   8491079

### 3.2 WIDE to LONG

In this second example,  We transform initial **dataframe** from **WIDE** to **LONG** format, we increase the number of **ROWS**, reducing the number of **columns**

In a **record** or **WIDE** format: Typically there is **one row** for each subject.

We use **melt()** method to reshape data from WIDE into LONG format

In [68]:
df3 = pd.DataFrame({
    'famid': [1, 1, 1, 2, 2, 2, 3, 3, 3],
    'birth': [1, 2, 3, 1, 2, 3, 1, 2, 3],
    'ht_one': [2.8, 2.9, 2.2, 2, 1.8, 1.9, 2.2, 2.3, 2.1],
    'ht_two': [3.4, 3.8, 2.9, 3.2, 2.8, 2.4, 3.3, 3.4, 2.9]
})

In [69]:
df3

   famid  birth  ht_one  ht_two
0      1      1     2.8     3.4
1      1      2     2.9     3.8
2      1      3     2.2     2.9
3      2      1     2.0     3.2
4      2      2     1.8     2.8
5      2      3     1.9     2.4
6      3      1     2.2     3.3
7      3      2     2.3     3.4
8      3      3     2.1     2.9

Then we use **melt()** method to re-shape previous dataFrame from  Wide to Long format.

In [70]:
df3_melt = df3.copy()

In [71]:
df3  = pd.melt(df3, id_vars = 'famid', value_vars = ['birth','ht_one','ht_two'])
df3

    famid variable  value
0       1    birth    1.0
1       1    birth    2.0
2       1    birth    3.0
3       2    birth    1.0
4       2    birth    2.0
5       2    birth    3.0
6       3    birth    1.0
7       3    birth    2.0
8       3    birth    3.0
9       1   ht_one    2.8
10      1   ht_one    2.9
11      1   ht_one    2.2
12      2   ht_one    2.0
13      2   ht_one    1.8
14      2   ht_one    1.9
15      3   ht_one    2.2
16      3   ht_one    2.3
17      3   ht_one    2.1
18      1   ht_two    3.4
19      1   ht_two    3.8
20      1   ht_two    2.9
21      2   ht_two    3.2
22      2   ht_two    2.8
23      2   ht_two    2.4
24      3   ht_two    3.3
25      3   ht_two    3.4
26      3   ht_two    2.9

In [72]:
print(df3)

    famid variable  value
0       1    birth    1.0
1       1    birth    2.0
2       1    birth    3.0
3       2    birth    1.0
4       2    birth    2.0
5       2    birth    3.0
6       3    birth    1.0
7       3    birth    2.0
8       3    birth    3.0
9       1   ht_one    2.8
10      1   ht_one    2.9
11      1   ht_one    2.2
12      2   ht_one    2.0
13      2   ht_one    1.8
14      2   ht_one    1.9
15      3   ht_one    2.2
16      3   ht_one    2.3
17      3   ht_one    2.1
18      1   ht_two    3.4
19      1   ht_two    3.8
20      1   ht_two    2.9
21      2   ht_two    3.2
22      2   ht_two    2.8
23      2   ht_two    2.4
24      3   ht_two    3.3
25      3   ht_two    3.4
26      3   ht_two    2.9

- Second example on how to pivot information from WIDE to LONG

In [53]:
df4 = pd.DataFrame({'team': ['A', 'B', 'C', 'D'],
                   'points': [88, 91, 99, 94],
                   'assists': [12, 17, 24, 28],
                   'rebounds': [22, 28, 30, 31]})

#view DataFrame
df4

  team  points  assists  rebounds
0    A      88       12        22
1    B      91       17        28
2    C      99       24        30
3    D      94       28        31

In [54]:
#reshape DataFrame from wide format to long format
df4 = pd.melt(df4, id_vars='team', value_vars=['points', 'assists', 'rebounds'])
df4

   team  variable  value
0     A    points     88
1     B    points     91
2     C    points     99
3     D    points     94
4     A   assists     12
5     B   assists     17
6     C   assists     24
7     D   assists     28
8     A  rebounds     22
9     B  rebounds     28
10    C  rebounds     30
11    D  rebounds     31

## Annex

### Online resources

<https://pandas.pydata.org/docs/user_guide/reshaping.html>

Pandas provides methods for manipulating a series and DataFrame to alter the representation of the data for further data processing or data summarization.

*Reshape wide to long using **pd.wide_to_long()** method*

<https://pandas.pydata.org/docs/reference/api/pandas.wide_to_long.html>

* Pandas Wide to long using pd.melt() method *

<https://www.statology.org/pandas-wide-to-long/>